[
	{
		"username": "Steeve",
		"password": "keke",
		"ban" : "1",
		"products": [{
			"id" : "1",
			"seller": "Steeve",
			"name": "League of Legends",
			"price": 998,
			"quantity": 1,
			"department": "PC game",
			"ban": "1",
			"description": "A pop game on pc",
			"comments": []
		},
		{
		"id" : "4",
		"seller": "Steeve",
		"name": "Great Again",
		"price": 100000,
		"quantity": 6,
		"department": "cell phone game",
		"ban": "1",
		"description": "A pop game on cell phone",
		"comments": []
		},
		{
			"id" : "3",
			"seller": "Steeve",
			"name": "Qiannvyouhun",
			"price": 299,
			"quantity": 10,
			"department": "cell phone game",
			"ban": "1",
			"description": "A pop game on cell phone",
			"comments": []
		},
		{
			"id" : "5",
			"seller": "Steeve",
			"name": "Super Mario Bros",
			"price": 98,
			"quantity": 6,
			"department": "Wii Game",
			"ban": "1",
			"description": "Super Mario Bros. is a platform video game developed and published by Nintendo for the Nintendo Entertainment System home console. Released as a sequel to the 1983 game Mario Bros., Super Mario Bros. was released in Japan and North America in 1985, and later in Europe and Australia two years later.",
			"comments": []
		},
		{
			"id" : "6",
			"seller": "Steeve",
			"name": "Overwatch",
			"price": 9000,
			"quantity": 666,
			"department": "PC game",
			"ban": "1",
			"description": "Overwatch is a team-based multiplayer first-person shooter video game developed and published by Blizzard Entertainment. It was released in May 2016 for Microsoft Windows, PlayStation 4, and Xbox One.Overwatch puts players into two teams of six, with each player selecting one of several pre-defined hero characters with unique movement, attributes, and abilities; these heroes are divided into four classes: Offense, Defense, Tank and Support. Players on a team work together to secure and defend control points on a map and/or escort a payload across the map in a limited amount of time. Players gain cosmetic rewards that do not affect gameplay, such as character skins and victory poses, as they continue to play in matches. The game was launched with casual play, while Blizzard added competitive ranked play about a month after launch. Additionally, Blizzard has developed and added new characters, maps, and game modes post-release, while stating that all Overwatch updates will remain free, with the only additional cost to players being microtransactions to earn additional cosmetic rewards.",
			"comments": []
		},
		{
			"id" : "7",
			"seller": "Steeve",
			"name": "Road Rash",
			"price": 10,
			"quantity": 100,
			"department": "PC game",
			"ban": "1",
			"description": "Road Rash is the name of a motorcycle-racing video game series by Electronic Arts in which the player participates in violent, illegal street races. The series started on the Sega Genesis and made its way to various other systems over the years. The game's title is based on the slang term for the severe friction burns that can occur in a motorcycle fall where skin comes into contact with the ground at high speed.",
			"comments": []
		},
		{
			"id" : "8",
			"seller": "Steeve",
			"name": "Dota2",
			"price": 500,
			"quantity": 25,
			"department": "PC game",
			"ban": "1",
			"description": "Dota 2 is a free-to-play multiplayer online battle arena (MOBA) video game developed and published by Valve Corporation. The game is the stand-alone sequel to Defense of the Ancients (DotA), which was a community-created mod for Blizzard Entertainment's Warcraft III: Reign of Chaos and its expansion pack, The Frozen Throne. Dota 2 is played in matches between two teams that consist of five players, with both teams occupying their own separate base on the map. Each of the ten players independently control a powerful character, known as a hero, that all feature unique abilities and different styles of play. During a match, a player and their team collects experience points and items for their heroes in order to push through the opposing team's defenses. A team wins by being the first to destroy a large structure located in the opposing team's base, called the Ancient.",
			"comments": []
		},
		{
			"id" : "9",
			"seller": "Steeve",
			"name": "Just Dance",
			"price": 6666,
			"quantity": 15,
			"department": "cell phone game",
			"ban": "1",
			"description": "Just Dance is a rhythm game series developed and published by Ubisoft. The series' title is derived from the Lady Gaga song of the same name, which also appears in the fifth game. The first game in the series was released in 2009 in North America, Europe, and Australia.",
			"comments": []
		}]
	},
	{
		"username": "Kylin",
		"password": "keke",
		"ban": "1",
		"products": [{
			"id" : "2",
			"seller": "Kylin",
			"name": "Yin Yang Shi",
			"price": 998,
			"quantity": 1,
			"department": "cell phone game",
			"ban": "1",
			"description": "A pop game on cell phone",
			"comments": [{"username": "Yuri","comment": "Nice Game!!!"}]
		},
		{
			"id" : "10",
			"seller": "Kylin",
			"name": "Super Mario Kart",
			"price": 998,
			"quantity": 15,
			"department": "Wii game",
			"ban": "1",
			"description": "Super Mario Kart is a 1992 go-kart racing video game developed and published by Nintendo for the Super Nintendo Entertainment System video game console. The first game of the Mario Kart series, it was launched in Japan on August 27, 1992, in North America on September 1, 1992, and in Europe on January 21, 1993.[1] Selling nine million copies worldwide, the game went on to become the third best selling SNES game of all time.[2] Super Mario Kart was re-released on the Wii's Virtual Console in Japan on June 9, 2009, North America on November 23, 2009, and in Europe on April 2, 2010.[3][4][5] Super Mario Kart was re-released again on the Wii U's Virtual Console in Japan on June 19, 2013, Europe on March 27, 2014, and in North America on August 6, 2014. Super Mario Kart was released once more on the New Nintendo 3DS's Virtual Console.",
			"comments": []
		},
		{
			"id" : "11",
			"seller": "Kylin",
			"name": "Pokemon Go",
			"price": 998,
			"quantity": 15,
			"department": "cell phone game",
			"ban": "1",
			"description": "Pokémon Go (stylized as Pokémon GO) is a free-to-play, location-based augmented reality game developed by Niantic for iOS, Android, and Apple Watch devices. The game is the result of a collaboration between Niantic and The Pokémon Company, and was initially released in selected countries in July 2016. In the game, players use a mobile device's GPS capability to locate, capture, battle, and train virtual creatures, called Pokémon, who appear on the screen as if they were in the same real-world location as the player. The game supports in-app purchases for additional in-game items.",
			"comments": []
		}]
	}
]